Revit 2027 API
PanelConfiguration Enumeration
 This enum declares the configuration for given panel schedule type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PanelConfiguration
Public Enumeration PanelConfiguration
public enum class PanelConfiguration
type PanelConfiguration
Members
Member name | Value | Description
OneColumn | 0 |  Circuits are numbered top-to-bottom in one single column.
TwoColumnsCircuitsAcross | 1 |  Circuits are numbered left-to-right. The odd circuits down the left side, even circuits down the right side.
TwoColumnsCircuitsDown | 2 |  Circuits are numbered top-to-bottom in one single column. First circuits down the left side, then the right side.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace